app/views/admin/events/edit.html.erb

SELECT "organizers".* FROM "organizers"
---
  <%= e.label :organizer %>
    <%= collection_select(:event, :organizer_id, Organizer.all, :id, :name, {}, {:multiple => false}) %>