app/views/admin/events/new.html.erb

    <%= e.label :organizer %>
    <%= collection_select(:event, :organizer_id, Organizer.all, :id, :name, {}, {:multiple => false}) %>
---
SELECT "organizers".* FROM "organizers"