app/controllers/admin/events_controller.rb

SELECT  "events".* FROM "events" ORDER BY id DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
	def index
		@events = Event.paginate(:page => params[:page], :per_page => 9).order('id')

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def show
		@event = Event.find(params[:id])
		@org_id = Event.find(params[:id]).organizer_id

INSERT INTO "events" ("city", "name", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["city", "dsd"], ["name", "dsda"], ["description", "dds"], ["date", "2018-02-11T12:00"], ["created_at", "2018-02-14 10:38:49.620439"], ["updated_at", "2018-02-14 10:38:49.620439"]]
---
	def create
		@event = Event.new(event_params)

		if (@event.save)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "image" = $1, "date" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["image", "Mountains_landscapes_nature_norway_rivers_fjord_2560x1440.jpg"], ["date", "2018-02-24T18:00"], ["updated_at", "2018-02-16 15:34:02.481990"], ["id", 14]]
---
	def update
		@event = Event.find(params[:id])

		if (@event.update(event_params))