app/controllers/events_controller.rb

	def index
		@events = Event.paginate(:page => params[:page], :per_page => 3).order('id DESC')
---
SELECT  "events".* FROM "events" ORDER BY id DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"

	def show
		@event = Event.find(params[:id])
		@org_id = Event.find(params[:id]).organizer_id
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]