app/controllers/organizers_controller.rb

	def index
		@organizers = Organizer.all
---
SELECT "organizers".* FROM "organizers"