app/controllers/organizers_controller.rb

	def index
		@organizers = Organizer.paginate(:page => params[:page], :per_page => 6).order(:name)
---
SELECT  "organizers".* FROM "organizers" ORDER BY "organizers"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "organizers"

	def show
		@organizer = Organizer.find(params[:id])
---
SELECT  "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]